Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: *Set up Your Host Development System to Support Development Using the Yocto Project*: See the ":ref:`dev-manual/start:preparing the build host`" section in the Yocto Project Development Tasks Manual for options on how to get a system ready to use the Yocto Project.
it_it: *Configurazione del Sistema di Sviluppo Host per Supportare lo Sviluppo con Yocto Project*: Consultare la sezione ":ref:`dev-manual/start:preparing the build host`" nel Manuale di Sviluppo dei Task di Yocto Project per le opzioni su come preparare un sistema per l'utilizzo di Yocto Project.

source: *Shared State Directory:* Controlled by the :term:`SSTATE_DIR` variable.
it_it: *Directory Shared State:* Controllata dalla variabile :term:`SSTATE_DIR`.

source: *Source Files:* Upstream releases, local projects, and SCMs.
it_it: *File Sorgente:* Release upstream, progetti locali e sistemi di controllo versione (SCM).

source: *Stage Your Changes:* Stage your changes by using the ``git add`` command on each file you modified. If you want to stage all the files you modified, you can even use the ``git add -A`` command.
it_it: *Staging delle Modifiche:* Aggiungere le modifiche all'area di staging utilizzando il comando ``git add`` su ogni file modificato. Per aggiungere tutti i file modificati all'area di staging, si può anche utilizzare il comando ``git add -A``.

source: *Steep Learning Curve:* The Yocto Project has a steep learning curve and has many different ways to accomplish similar tasks. It can be difficult to choose between such ways.
it_it: *Curva di Apprendimento Ripida:* Yocto Project presenta una curva di apprendimento ripida e offre molti modi diversi per svolgere attività simili. Può essere difficile scegliere tra questi metodi.

source: *Step-by-step Instructions for Development Tasks:* Instructional procedures reside in other manuals within the Yocto Project documentation set. For example, the :doc:`/dev-manual/index` provides examples on how to perform various development tasks. As another example, the :doc:`/sdk-manual/index` manual contains detailed instructions on how to install an SDK, which is used to develop applications for target hardware.
it_it: *Istruzioni Dettagliate per i Task di Sviluppo:* Le procedure dettagliate si trovano in altri manuali all'interno della documentazione di Yocto Project. Ad esempio, il manuale :doc:`/dev-manual/index` fornisce esempi su come eseguire diversi task di sviluppo. Un altro esempio è il manuale :doc:`/sdk-manual/index`, che contiene istruzioni dettagliate su come installare un SDK, utilizzato per sviluppare applicazioni per l'hardware di destinazione [target].

source: *Supports Partial Builds:* You can build and rebuild individual packages as needed. Yocto Project accomplishes this through its :ref:`overview-manual/concepts:shared state cache` (sstate) scheme. Being able to build and debug components individually eases project development.
it_it: *Supporta le Build Parziali:* È possibile compilare e ricompilare singoli pacchetti secondo necessità. Yocto Project realizza ciò tramite il suo schema di cache di stato shared (sstate) (:ref:`overview-manual/concepts:shared state cache`). La possibilità di compilare ed eseguire il debug dei componenti singolarmente semplifica lo sviluppo del progetto.

source: *Target Machine Selection:* Controlled by the :term:`MACHINE` variable.
it_it: *Selezione della Macchina Target:* Controllata dalla variabile :term:`MACHINE`.

source: *Tasks:* This `video <https://www.youtube.com/watch?v=D4-9vGSxQtw>`__ shows the information Toaster provides about the tasks run by the build system.
it_it: *Tasks:* Questo `video <https://www.youtube.com/watch?v=D4-9vGSxQtw>`__ mostra le informazioni fornite da Toaster sui task eseguiti dal sistema di build.

source: *This list is currently empty*
it_it: *Questo elenco è attualmente vuoto*

source: *Toaster Homepage and Table Controls:* This `video <https://www.youtube.com/watch?v=QEARDnrR1Xw>`__ goes over the Toaster entry page, and provides an overview of the data manipulation capabilities of Toaster, which include search, sorting and filtering by different criteria.
it_it: *Toaster Homepage and Table Controls:* Questo `video <https://www.youtube.com/watch?v=QEARDnrR1Xw>`__ illustra la pagina di inserimento di Toaster e fornisce una panoramica delle funzionalità di manipolazione dei dati di Toaster, che includono ricerca, ordinamento e filtraggio in base a diversi criteri.

source: *Toaster:* Regardless of what your Build Host is running, you can use Toaster to develop software using the Yocto Project. Toaster is a web interface to the Yocto Project's :term:`OpenEmbedded Build System`. The interface allows you to configure and run your builds. Information about builds is collected and stored in a database. You can use Toaster to configure and start builds on multiple remote build servers.
it_it: *Toaster:* Indipendentemente dal sistema operativo in esecuzione sul Build Host, è possibile utilizzare Toaster per sviluppare software con Yocto Project. Toaster è un'interfaccia web per il :term:`OpenEmbedded Build System` di Yocto Project. L'interfaccia consente di configurare ed eseguire le build. Le informazioni relative alle build vengono raccolte e memorizzate in un database. È possibile utilizzare Toaster per configurare e avviare build su più server di build remoti.

source: *Toaster:* Toaster is a web interface to the Yocto Project OpenEmbedded build system. Toaster allows you to configure, run, and view information about builds. For information on Toaster, see the :doc:`/toaster-manual/index`.
it_it: *Toaster:* Toaster è un'interfaccia web per il sistema di build OpenEmbedded di Yocto Project. Toaster consente di configurare, eseguire e visualizzare informazioni sulle build. Per ulteriori informazioni su Toaster, consultare il manuale :doc:`/toaster-manual/index`.

source: *Understanding What Changes You Need to Make For Your Design Requires Some Research:* Beyond the simple tutorial stage, understanding what changes need to be made for your particular design can require a significant amount of research and investigation. For information that helps you transition from trying out the Yocto Project to using it for your project, see the ":ref:`what-i-wish-id-known:what i wish i'd known about yocto project`" and ":ref:`transitioning-to-a-custom-environment:transitioning to a custom environment for systems development`" documents on the Yocto Project website.
it_it: *Comprendere Quali Modifiche Apportare al Progetto Richiede Ricerca:* Oltre alla semplice fase di tutorial, comprendere quali modifiche apportare al progetto specifico può richiedere una notevole quantità di ricerca e approfondimento. Per informazioni che aiutino a passare dalla fase di prova di Yocto Project al suo utilizzo per il progetto, consultare i documenti ":ref:`what-i-wish-id-known:what i wish i'd known about yocto project`" e ":ref:`transitioning-to-a-custom-environment:transitioning to a custom environment for systems development`" sul sito web di Yocto Project.

source: *Use Branches Liberally:* It is very easy to create, use, and delete local branches in your working Git repository on the development host. You can name these branches anything you like. It is helpful to give them names associated with the particular feature or change on which you are working. Once you are done with a feature or change and have merged it into your local development branch, simply discard the temporary branch.
it_it: *Utilizzare i Branch Liberamente:* È molto semplice creare, utilizzare ed eliminare branch locali nel proprio repository Git di lavoro sull'host di sviluppo. Si può assegnare a questi branch qualsiasi nome. È utile assegnare loro nomi associati alla specifica funzionalità o modifica su cui si sta lavorando. Una volta terminata una funzionalità o una modifica e dopo averla unita al branch di sviluppo locale, è sufficiente eliminare il branch temporaneo.

source: *Use Push and Pull:* The push-pull workflow is based on the concept of developers "pushing" local commits to a remote repository, which is usually a contribution repository. This workflow is also based on developers "pulling" known states of the project down into their local development repositories. The workflow easily allows you to pull changes submitted by other developers from the upstream repository into your work area ensuring that you have the most recent software on which to develop. The Yocto Project has two scripts named ``create-pull-request`` and ``send-pull-request`` that ship with the release to facilitate this workflow. You can find these scripts in the ``scripts`` folder of :term:`OpenEmbedded-Core (OE-Core)`. For information on how to use these scripts, see the ":ref:`contributor-guide/submit-changes:using scripts to push a change upstream and request a pull`" section in the Yocto Project and OpenEmbedded Contributor Guide.
it_it: *Utilizzo di Push e Pull:* Il flusso di lavoro push-pull si basa sul concetto di sviluppatori che "spingono" [pushing] commit locali a un repository remoto, che di solito è un repository di contributi. Questo flusso di lavoro si basa anche sul "tirare" [pulling] da parte degli sviluppatori degli stati noti del progetto nei propri repository di sviluppo locali. Il flusso di lavoro consente di scaricare facilmente le modifiche inviate da altri sviluppatori dal repository upstream alla propria area di lavoro, garantendo di avere sempre a disposizione il software più recente su cui sviluppare. Yocto Project include due script denominati ``create-pull-request`` e ``send-pull-request``, forniti con la release per facilitare questo flusso di lavoro. Questi script si trovano nella cartella ``scripts`` di :term:`OpenEmbedded-Core (OE-Core)`. Per informazioni su come utilizzare questi script, consultare la sezione ":ref:`contributor-guide/submit-changes:using scripts to push a change upstream and request a pull`" nella Guida per i Collaboratori di Yocto Project e di OpenEmbedded.

source: *Use a Yocto Linux Kernel:* Kernel recipes in the BSP should be based on a Yocto Linux kernel. Basing your recipes on these kernels reduces the costs for maintaining the BSP and increases its scalability. See the ``Yocto Linux Kernel`` category in the :yocto_git:`Source Repositories <>` for these kernels.
it_it: *Utilizzare un kernel Yocto Linux:* Le ricette del kernel nel BSP devono essere basate su un kernel Yocto Linux. Basare le ricette su questi kernel riduce i costi di manutenzione del BSP e ne aumenta la scalabilità. Consultare la categoria ``Yocto Linux Kernel`` nei repository sorgente di :yocto_git:`Source Repositories <>` per questi kernel.

source: *Use the LICENSE_FLAGS Variable to Define the Recipes that Have Commercial or Other Types of Specially-Licensed Packages:* For each of those recipes, you can specify a matching license string in a :ref:`structure-build-conf-local.conf` variable named :term:`LICENSE_FLAGS_ACCEPTED`. Specifying the matching license string signifies that you agree to the license. Thus, the build system can build the corresponding recipe and include the component in the image. See the ":ref:`dev-manual/licenses:enabling commercially licensed recipes`" section in the Yocto Project Development Tasks Manual for details on how to use these variables.
it_it: *Utilizzare la Variabile LICENSE_FLAGS per Definire le Ricette che Contengono Pacchetti con Licenza Commerciale o di Altro Tipo:* Per ciascuna di queste ricette, è possibile specificare una stringa di licenza corrispondente in una variabile del file :ref:`structure-build-conf-local.conf` denominata :term:`LICENSE_FLAGS_ACCEPTED`. Specificare la stringa di licenza corrispondente indica l'accettazione della licenza. In questo modo, il sistema di build può compilare la ricetta corrispondente e includere il componente nell'immagine. Per ulteriori dettagli sull'utilizzo di queste variabili, consultare la sezione ":ref:`dev-manual/licenses:enabling commercially licensed recipes`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: *User Configuration:* metadata you can use to control the build process.
it_it: *Configurazione Utente:* Metadati utilizzabili per controllare il processo di build.

source: *Uses a Layer Model:* The Yocto Project :ref:`layer infrastructure <overview-manual/yp-intro:the yocto project layer model>` groups related functionality into separate bundles. You can incrementally add these grouped functionalities to your project as needed. Using layers to isolate and group functionality reduces project complexity and redundancy, allows you to easily extend the system, make customizations, and keep functionality organized.
it_it: *Utilizza un Modello a Layer:* L':ref:`infrastruttura a layer <overview-manual/yp-intro:the yocto project layer model>` di Yocto Project raggruppa le funzionalità correlate in bundle separati. È possibile aggiungere gradualmente queste funzionalità raggruppate al progetto, a seconda delle necessità. L'utilizzo dei layer per isolare e raggruppare le funzionalità riduce la complessità e la ridondanza del progetto, consente di estendere facilmente il sistema, apportare personalizzazioni e mantenere le funzionalità organizzate.

source: *Using Toaster:* The other Yocto Project development method that involves an interface that effectively puts the Yocto Project into the background is Toaster. Toaster provides an interface to the OpenEmbedded build system. The interface enables you to configure and run your builds. Information about builds is collected and stored in a database. You can use Toaster to configure and start builds on multiple remote build servers.
it_it: *Utilizzo di Toaster:* L'altro metodo di sviluppo di Yocto Project che prevede l'utilizzo di un'interfaccia che di fatto mette Yocto Project in background è Toaster. Toaster fornisce un'interfaccia per il sistema di build OpenEmbedded. L'interfaccia consente di configurare ed eseguire le compilazioni. Le informazioni sulle compilazioni vengono raccolte e memorizzate in un database. È possibile utilizzare Toaster per configurare e avviare compilazioni su più server di compilazione remoti.

source: *Using the VSCode Extension:* You can use the `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ extension for Visual Studio Code to start your BitBake builds through a graphical user interface.
it_it: *Utilizzo dell'Estensione VSCode:* Si può usare l'estensione `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ per Visual Studio Code per avviare le build BitBake tramite un'interfaccia grafica

source: *VSCode IDE Extension:* The `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ extension for Visual Studio Code provides a rich set of features for working with BitBake recipes. The extension provides syntax highlighting, hover tips, and completion for BitBake files as well as embedded Python and Bash languages. Additional views and commands allow you to efficiently browse, build and edit recipes. It also provides SDK integration for cross-compiling and debugging through ``devtool``.
it_it: *Estensione VSCode IDE:* L'estensione `Yocto Project BitBake <https://marketplace.visualstudio.com/items?itemName=yocto-project.yocto-bitbake>`__ per Visual Studio Code offre una ricca serie di funzionalità per lavorare con le ricette BitBake. L'estensione fornisce evidenziazione della sintassi, suggerimenti al passaggio del mouse e completamento automatico per i file BitBake, nonché per i linguaggi Python e Bash embedded. Ulteriori visualizzazioni e comandi consentono di esplorare, compilare e modificare le ricette in modo efficiente. Offre anche l'integrazione con l'SDK per la cross-compilazione e il debug tramite ``devtool``.

source: *Widely Adopted Across the Industry:* Many semiconductor, operating system, software, and service vendors adopt and support the Yocto Project in their products and services. For a look at the Yocto Project community and the companies involved with the Yocto Project, see the "COMMUNITY" and "ABOUT" tabs on the :yocto_home:`Yocto Project <>` home page.
it_it: *Ampiamente Adottato nel Settore:* Molti produttori di semiconduttori, sistemi operativi, software e servizi adottano e supportano Yocto Project nei loro prodotti e servizi. Per una panoramica della community di Yocto Project e delle aziende coinvolte, consultare le schede "COMMUNITY" e "ABOUT" nella pagina home di :yocto_home:`Yocto Project <>`.

source: *Windows Subsystem For Linux (WSL 2):* You may use Windows Subsystem For Linux version 2 to set up a Build Host using Windows 10 or later, or Windows Server 2019 or later.
it_it: *Windows Subsystem For Linux (WSL 2):* È possibile utilizzare il Windows Subsystem For Linux versione 2 per configurare un Build Host con Windows 10 o versioni successive, oppure Windows Server 2019 o versioni successive.

source: *Working in a Cross-Build Environment Can Feel Unfamiliar:* When developing code to run on a target, compilation, execution, and testing done on the actual target can be faster than running a BitBake build on a development host and then deploying binaries to the target for test. While the Yocto Project does support development tools on the target, the additional step of integrating your changes back into the Yocto Project build environment would be required. Yocto Project supports an intermediate approach that involves making changes on the development system within the BitBake environment and then deploying only the updated packages to the target.
it_it: *Lavorare in un Ambiente di Cross-build può Risultare Insolito:* Quando si sviluppa codice da eseguire su una piattaforma target, la compilazione, l'esecuzione e il test sulla piattaforma stessa possono essere più veloci rispetto all'esecuzione di una build BitBake su un host di sviluppo e al successivo deployment dei binari sulla piattaforma target per il test. Sebbene Yocto Project supporti gli strumenti di sviluppo sulla piattaforma target, è comunque necessario integrare le modifiche nell'ambiente di build di Yocto Project. Yocto Project supporta un approccio intermedio che prevede di apportare modifiche al sistema di sviluppo all'interno dell'ambiente BitBake e quindi di distribuire sul sistema target solo i pacchetti aggiornati.

source: *Yocto Project "Master" or OpenEmbedded "Master":* This release causes your Toaster Projects to build against the head of the master branch, which is where active development takes place, at :yocto_git:`/poky/log/` or :oe_git:`/openembedded-core/log/`.
it_it: *Yocto Project "Master" o OpenEmbedded "Master":* Questa versione fa sì che i progetti Toaster vengano compilati utilizzando l'ultima versione del branch master, dove si svolge lo sviluppo attivo, disponibile all'indirizzo :yocto_git:`/poky/log/` o :oe_git:`/openembedded-core/log/`.

source: *Yocto Project 6.1 "Blacksail" or OpenEmbedded "Blacksail":* This release causes your Toaster projects to build against the head of the blacksail branch at :yocto_git:`/poky/log/?h=blacksail` or :oe_git:`/openembedded-core/commit/?h=blacksail`.
it_it: *Yocto Project 6.1 "Blacksail" o OpenEmbedded "Blacksail":* Questa versione fa sì che i progetti Toaster vengano compilati utilizzando l'ultima versione del branch blacksail, disponibile all'indirizzo :yocto_git:`/poky/log/?h=blacksail` o :oe_git:`/openembedded-core/commit/?h=blacksail`.

source: *auto.conf:* The file is usually created and written to by an autobuilder. The settings put into the file are typically the same as you would find in the :ref:`structure-build-conf-local.conf` or the :ref:`structure-build-conf-site.conf` files.
it_it: *auto.conf:* Il file viene solitamente creato e modificato da un autobuilder. Le impostazioni inserite nel file sono in genere le stesse che si troverebbero nei file :ref:`structure-build-conf-local.conf` o :ref:`structure-build-conf-site.conf`.

source: *bitbake "master-next" branch:* This branch is part of the :oe_git:`bitbake </bitbake/>` repository and contains changes to :term:`BitBake`.
it_it: *bitbake "master-next" branch:* Questo branch fa parte del repository :oe_git:`bitbake </bitbake/>` e contiene modifiche a :term:`BitBake`.

source: *classes*, *classes-global*, *classes-recipe:* Class files (``.bbclass``) hold common functionality that can be shared among recipes in the distribution. When your recipes inherit a class, they take on the settings and functions for that class. You can read more about class files in the ":ref:`ref-manual/classes:Classes`" chapter of the Yocto Reference Manual.
it_it: *classes*, *classes-global*, *classes-recipe:* I file di classe (``.bbclass``) contengono funzionalità comuni che possono essere condivise tra le ricette nella distribuzione. Quando le ricette ereditano una classe, ne assumono le impostazioni e le funzioni. Per ulteriori informazioni sui file di classe, consultare il capitolo ":ref:`ref-manual/classes:Classes`" del Manuale di Riferimenti di Yocto.

source: *conf:* This area holds configuration files for the layer (``conf/layer.conf``), the distribution (``conf/distro/distro.conf``), and any distribution-wide include files.
it_it: *conf:* Questa area contiene i file di configurazione per il layer (``conf/layer.conf``), la distribuzione (``conf/distro/distro.conf``) e tutti i file di inclusione a livello di distribuzione.

source: *devtool:* This command-line tool is available as part of the extensible SDK (eSDK) and is its cornerstone. You can use ``devtool`` to help build, test, and package software within the eSDK. You can use the tool to optionally integrate what you build into an image built by the OpenEmbedded build system.
it_it: *devtool:* Questo strumento da riga di comando è disponibile come parte dell'SDK estensibile (eSDK) e ne rappresenta il fondamento. Si può utilizzare ``devtool`` per compilare, testare e impacchettare il software all'interno dell'eSDK. Puoi utilizzare lo strumento per integrare facoltativamente il lavoro in un'immagine creata dal sistema di build OpenEmbedded.

source: *git add:* Locally stages updated file contents to the index that Git uses to track changes. You must stage all files that have changed before you can commit them.
it_it: *git add:* Aggiunge localmente all'indice utilizzato da Git per tenere traccia delle modifiche il contenuto aggiornato dei file. È necessario aggiungere all'area di staging tutti i file modificati prima di poterli confermare [commit].

source: *git branch -D branch-name:* Deletes an existing local branch. You need to be in a local branch other than the one you are deleting in order to delete branch-name.
it_it: *git branch -D branch-name:* Elimina un branch locale esistente. Ci si deve trovare in un branch locale diverso da quello che si sta eliminando per poter eliminare branch-name.

source: *git branch:* Displays the existing local branches associated with your local repository. The branch that you have currently checked out is noted with an asterisk character.
it_it: *git branch:* Visualizza i branch locali esistenti associati al proprio repository locale. Il branch attualmente selezionato è indicato con un asterisco.
